---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Selection Properties
Selection Class See Also Send Feedback
---

The Selection type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

Selection Class

Autodesk.Revit.UI.Selection Namespace